// lib/data/mock_surah.dart
const Map<String, dynamic> mockSurah1 = {
  "1": {
    "arabic": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ",
    "thai_v3": "ด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปรานี ผู้ทรงเมตตาเสมอ",
    "thai_v2": "ด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปรานี ผู้ทรงเมตตาเสมอ"
  },
  "2": {
    "arabic": "ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَٰلَمِينَ",
    "thai_v3": "การสรรเสริญทั้งมวลเป็นกรรมสิทธิ์ของอัลลอฮฺพระเจ้าแห่งสากลโลก",
    "thai_v2": "การสรรเสริญทั้งมวลเป็นกรรมสิทธิ์ของอัลลอฮฺพระเจ้าแห่งสากลโลก"
  },
  "3": {
    "arabic": "ٱلرَّحْمَٰنِ ٱلرَّحِيمِ",
    "thai_v3": "ผู้ทรงกรุณาปรานี ผู้ทรงเมตตาเสมอ",
    "thai_v2": "ผู้ทรงกรุณาปรานี ผู้ทรงเมตตาเสมอ"
  },
  "4": {
    "arabic": "مَٰلِكِ يَوْمِ ٱلدِّينِ",
    "thai_v3": "ผู้ทรงอภิสิทธิ์แห่งวันตอบแทน",
    "thai_v2": "ผู้ทรงอภิสิทธิ์แห่งวันตอบแทน"
  },
  "5": {
    "arabic": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
    "thai_v3": "เฉพาะพระองค์เท่านั้นที่พวกข้าพระองค์เคารพภักดี และเฉพาะพระองค์เท่านั้นที่พวกข้าพระองค์ขอความช่วยเหลือ",
    "thai_v2": "เฉพาะพระองค์เท่านั้นที่พวกข้าพระองค์เคารพภักดี และเฉพาะพระองค์เท่านั้นที่พวกข้าพระองค์ขอความช่วยเหลือ"
  },
  "6": {
    "arabic": "ٱهْدِنَا ٱلصِّرَٰطَ ٱلْمُسْتَقِيمَ",
    "thai_v3": "ขอพระองค์ทรงแนะนำพวกข้าพระองค์ซึ่งทางอันเที่ยงตรง",
    "thai_v2": "ขอพระองค์ทรงแนะนำพวกข้าพระองค์ซึ่งทางอันเที่ยงตรง"
  },
  "7": {
    "arabic": "صِرَٰطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِمْ وَلَا ٱلضَّآلِّينَ",
    "thai_v3": "ทางของบรรดาผู้ที่พระองค์ได้ทรงโปรดปรานแก่พวกเขา มิใช่ทางของพวกที่ถูกกริ้ว และมิใช่ทางของพวกที่หลงผิด",
    "thai_v2": "ทางของบรรดาผู้ที่พระองค์ได้ทรงโปรดปรานแก่พวกเขา มิใช่ทางของพวกที่ถูกกริ้ว และมิใช่ทางของพวกที่หลงผิด"
  }
};
